<details><summary>Digger run report at 2023-10-09 12:54:36 (UTC)</summary>
    <details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Changes to Outputs:
  + available_azs = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
      + "us-east-1d",
      + "us-east-1e",
      + "us-east-1f",
    ]
  + first_3_azs   = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

available_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
  "us-east-1d",
  "us-east-1e",
  "us-east-1f",
])
first_3_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])

  ```
</details>

<details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-us-east-1a"
          + "Terraform"   = "true"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-private"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-private"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-public"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "staging"
          + "Name"                            = "vpc-staging-private-us-east-1a"
          + "Terraform"                       = "true"
          + "kubernetes.io/cluster/staging"   = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "staging"
          + "Name"                            = "vpc-staging-private-us-east-1a"
          + "Terraform"                       = "true"
          + "kubernetes.io/cluster/staging"   = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "staging"
          + "Name"                            = "vpc-staging-private-us-east-1b"
          + "Terraform"                       = "true"
          + "kubernetes.io/cluster/staging"   = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "staging"
          + "Name"                            = "vpc-staging-private-us-east-1b"
          + "Terraform"                       = "true"
          + "kubernetes.io/cluster/staging"   = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "staging"
          + "Name"                            = "vpc-staging-private-us-east-1c"
          + "Terraform"                       = "true"
          + "kubernetes.io/cluster/staging"   = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "staging"
          + "Name"                            = "vpc-staging-private-us-east-1c"
          + "Terraform"                       = "true"
          + "kubernetes.io/cluster/staging"   = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                   = "staging"
          + "Name"                          = "vpc-staging-public-us-east-1a"
          + "Terraform"                     = "true"
          + "kubernetes.io/cluster/staging" = "owned"
          + "kubernetes.io/role/elb"        = "1"
        }
      + tags_all                                       = {
          + "Environment"                   = "staging"
          + "Name"                          = "vpc-staging-public-us-east-1a"
          + "Terraform"                     = "true"
          + "kubernetes.io/cluster/staging" = "owned"
          + "kubernetes.io/role/elb"        = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                   = "staging"
          + "Name"                          = "vpc-staging-public-us-east-1b"
          + "Terraform"                     = "true"
          + "kubernetes.io/cluster/staging" = "owned"
          + "kubernetes.io/role/elb"        = "1"
        }
      + tags_all                                       = {
          + "Environment"                   = "staging"
          + "Name"                          = "vpc-staging-public-us-east-1b"
          + "Terraform"                     = "true"
          + "kubernetes.io/cluster/staging" = "owned"
          + "kubernetes.io/role/elb"        = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                   = "staging"
          + "Name"                          = "vpc-staging-public-us-east-1c"
          + "Terraform"                     = "true"
          + "kubernetes.io/cluster/staging" = "owned"
          + "kubernetes.io/role/elb"        = "1"
        }
      + tags_all                                       = {
          + "Environment"                   = "staging"
          + "Name"                          = "vpc-staging-public-us-east-1c"
          + "Terraform"                     = "true"
          + "kubernetes.io/cluster/staging" = "owned"
          + "kubernetes.io/role/elb"        = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "Name"        = "vpc-staging"
          + "Terraform"   = "true"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = [
      + (known after apply),
    ]
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "vpc-staging"
  + nat_ids                                     = [
      + (known after apply),
    ]
  + nat_public_ips                              = [
      + (known after apply),
    ]
  + natgw_ids                                   = [
      + (known after apply),
    ]
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = [
      + (known after apply),
    ]
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.0.0.0/24",
      + "10.0.1.0/24",
      + "10.0.2.0/24",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.0.3.0/24",
      + "10.0.4.0/24",
      + "10.0.5.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.0.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_cloudwatch_iam_role_arn        = ""
  + vpc_flow_log_destination_arn                = ""
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []
aws_vpc.this[0]: Creating...
aws_vpc.this[0]: Still creating... [10s elapsed]
aws_vpc.this[0]: Creation complete after 11s [id=vpc-0eb2a652acf75f095]
aws_route_table.public[0]: Creating...
aws_internet_gateway.this[0]: Creating...
aws_subnet.private[1]: Creating...
aws_subnet.private[0]: Creating...
aws_subnet.private[2]: Creating...
aws_subnet.public[1]: Creating...
aws_subnet.public[0]: Creating...
aws_default_route_table.default[0]: Creating...
aws_default_network_acl.this[0]: Creating...
aws_default_security_group.this[0]: Creating...
aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-0e968fdcec6c53d4c]
aws_route_table.private[0]: Creating...
aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-09df691f5f8bdbfcf]
aws_subnet.public[2]: Creating...
aws_route_table.public[0]: Creation complete after 1s [id=rtb-06348981a47803060]
aws_eip.nat[0]: Creating...
aws_subnet.private[2]: Creation complete after 1s [id=subnet-032e26caad5563409]
aws_route.public_internet_gateway[0]: Creating...
aws_subnet.public[0]: Creation complete after 1s [id=subnet-040bbd7ead1a94e11]
aws_subnet.private[1]: Creation complete after 1s [id=subnet-0a214832f131a1911]
aws_subnet.public[1]: Creation complete after 1s [id=subnet-0f549f32169b50fb3]
aws_route_table.private[0]: Creation complete after 0s [id=rtb-0a81123c5225b1f39]
aws_subnet.public[2]: Creation complete after 0s [id=subnet-0af181ca53c8ae3a9]
aws_route_table_association.public[0]: Creating...
aws_route_table_association.public[1]: Creating...
aws_route_table_association.public[2]: Creating...
aws_eip.nat[0]: Creation complete after 0s [id=eipalloc-0f6fafb0a92e69e84]
aws_nat_gateway.this[0]: Creating...
aws_subnet.private[0]: Creation complete after 1s [id=subnet-09e39c8285e4e8473]
aws_route_table_association.private[2]: Creating...
aws_route_table_association.private[0]: Creating...
aws_route_table_association.private[1]: Creating...
aws_default_security_group.this[0]: Creation complete after 1s [id=sg-0e722b7ab168ee331]
aws_route.public_internet_gateway[0]: Creation complete after 0s [id=r-rtb-06348981a478030601080289494]
aws_default_network_acl.this[0]: Creation complete after 1s [id=acl-0fd485dabb464fd27]
aws_route_table_association.private[0]: Creation complete after 0s [id=rtbassoc-023c969a98c1e2c01]
aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-0b7a20b8264726d2f]
aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-0a18131157f4912f9]
aws_route_table_association.private[2]: Creation complete after 1s [id=rtbassoc-0841ae102c99724f7]
aws_route_table_association.public[2]: Creation complete after 1s [id=rtbassoc-0ab77c979fd8debbd]
aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0a60519fce0ef72bb]
aws_nat_gateway.this[0]: Still creating... [10s elapsed]
aws_nat_gateway.this[0]: Still creating... [20s elapsed]
aws_nat_gateway.this[0]: Still creating... [30s elapsed]
aws_nat_gateway.this[0]: Still creating... [40s elapsed]
aws_nat_gateway.this[0]: Still creating... [50s elapsed]
aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
aws_nat_gateway.this[0]: Creation complete after 1m24s [id=nat-017290fbb95122cfd]
aws_route.private_nat_gateway[0]: Creating...
aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0a81123c5225b1f391080289494]

Apply complete! Resources: 23 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = tolist([
  "rtb-0a81123c5225b1f39",
])
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-0fd485dabb464fd27"
default_route_table_id = "rtb-0e968fdcec6c53d4c"
default_security_group_id = "sg-0e722b7ab168ee331"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-0a81123c5225b1f39",
]
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:039454511521:internet-gateway/igw-09df691f5f8bdbfcf"
igw_id = "igw-09df691f5f8bdbfcf"
intra_route_table_association_ids = []
intra_route_table_ids = []
intra_subnet_arns = []
intra_subnets = []
intra_subnets_cidr_blocks = tolist([])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-staging"
nat_ids = [
  "eipalloc-0f6fafb0a92e69e84",
]
nat_public_ips = tolist([
  "3.234.62.214",
])
natgw_ids = [
  "nat-017290fbb95122cfd",
]
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = [
  "r-rtb-0a81123c5225b1f391080289494",
]
private_route_table_association_ids = [
  "rtbassoc-023c969a98c1e2c01",
  "rtbassoc-0a60519fce0ef72bb",
  "rtbassoc-0841ae102c99724f7",
]
private_route_table_ids = [
  "rtb-0a81123c5225b1f39",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-09e39c8285e4e8473",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0a214832f131a1911",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-032e26caad5563409",
]
private_subnets = [
  "subnet-09e39c8285e4e8473",
  "subnet-0a214832f131a1911",
  "subnet-032e26caad5563409",
]
private_subnets_cidr_blocks = tolist([
  "10.0.0.0/24",
  "10.0.1.0/24",
  "10.0.2.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-06348981a478030601080289494"
public_route_table_association_ids = [
  "rtbassoc-0a18131157f4912f9",
  "rtbassoc-0b7a20b8264726d2f",
  "rtbassoc-0ab77c979fd8debbd",
]
public_route_table_ids = [
  "rtb-06348981a47803060",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-040bbd7ead1a94e11",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0f549f32169b50fb3",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0af181ca53c8ae3a9",
]
public_subnets = [
  "subnet-040bbd7ead1a94e11",
  "subnet-0f549f32169b50fb3",
  "subnet-0af181ca53c8ae3a9",
]
public_subnets_cidr_blocks = tolist([
  "10.0.3.0/24",
  "10.0.4.0/24",
  "10.0.5.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-0a81123c5225b1f39",
])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:039454511521:vpc/vpc-0eb2a652acf75f095"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-0eb2a652acf75f095"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-0e968fdcec6c53d4c"
vpc_owner_id = "039454511521"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>

</details>